#### Terraform Format and Style 🖌 `failure` (ignored)
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.discord_simde.discord_channel_permission.curieux_general will be created
  + resource "discord_channel_permission" "curieux_general" {
      + allow        = 100764736
      + channel_id   = "778331758302593074"
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = (known after apply)
      + type         = "role"
    }

  # module.discord_simde.discord_role.admin will be updated in-place
  ~ resource "discord_role" "admin" {
        id          = "759778778212991066"
        name        = "Saint administrateur"
      ~ position    = 10 -> 11
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.bde will be updated in-place
  ~ resource "discord_role" "bde" {
        id          = "811739466012164167"
        name        = "BDE"
      ~ position    = 3 -> 4
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.curieux will be created
  + resource "discord_role" "curieux" {
      + color       = 7974143
      + hoist       = false
      + id          = (known after apply)
      + managed     = (known after apply)
      + mentionable = false
      + name        = "Honorable curieux"
      + permissions = 103924288
      + position    = 1
      + server_id   = "759778767831957535"
    }

  # module.discord_simde.discord_role.integ will be updated in-place
  ~ resource "discord_role" "integ" {
        id          = "802911395758473247"
        name        = "Integ"
      ~ position    = 6 -> 7
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.jeffrey will be updated in-place
  ~ resource "discord_role" "jeffrey" {
        id          = "782684806961561660"
        name        = "Projet Jeffrey"
      ~ position    = 5 -> 6
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.member will be updated in-place
  ~ resource "discord_role" "member" {
      ~ color       = 4360181 -> 4223216
        id          = "759778776560828447"
        name        = "Vénéré membre"
      ~ position    = 2 -> 3
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.payutc will be updated in-place
  ~ resource "discord_role" "payutc" {
        id          = "776093666267758604"
        name        = "Tim Pay'UTC"
      ~ position    = 8 -> 9
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.respinfo will be updated in-place
  ~ resource "discord_role" "respinfo" {
      ~ color       = 4360181 -> 4223216
        id          = "781934406292996116"
        name        = "Elegant Resp Info"
      ~ position    = 1 -> 2
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.treso will be updated in-place
  ~ resource "discord_role" "treso" {
        id          = "777569554539741255"
        name        = "Projet Flairsou"
      ~ position    = 7 -> 8
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.woolly will be updated in-place
  ~ resource "discord_role" "woolly" {
        id          = "784568395907465216"
        name        = "Woolly"
      ~ position    = 4 -> 5
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.zapier will be updated in-place
  ~ resource "discord_role" "zapier" {
        id          = "791043844132962315"
        name        = "Zapier"
      ~ position    = 9 -> 10
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 10 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*